Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/disk/container/random-read.txt
random-read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=16
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

random-read: (groupid=0, jobs=1): err= 0: pid=10: Tue Sep 22 05:18:30 2026
  read: IOPS=8813, BW=34.4MiB/s (36.1MB/s)(1033MiB/30001msec)
    clat (usec): min=42, max=4122, avg=112.92, stdev=67.76
     lat (usec): min=42, max=4122, avg=112.96, stdev=67.76
    clat percentiles (usec):
     |  1.00th=[   46],  5.00th=[   48], 10.00th=[   51], 20.00th=[   56],
     | 30.00th=[   57], 40.00th=[   60], 50.00th=[  124], 60.00th=[  153],
     | 70.00th=[  159], 80.00th=[  169], 90.00th=[  184], 95.00th=[  190],
     | 99.00th=[  217], 99.50th=[  251], 99.90th=[  465], 99.95th=[  873],
     | 99.99th=[ 1844]
   bw (  KiB/s): min=23105, max=37344, per=100.00%, avg=35265.71, stdev=2322.45, samples=59
   iops        : min= 5776, max= 9336, avg=8816.29, stdev=580.60, samples=59
  lat (usec)   : 50=7.53%, 100=42.38%, 250=49.59%, 500=0.42%, 750=0.03%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%
  cpu          : usr=1.39%, sys=9.35%, ctx=264306, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=264413,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=34.4MiB/s (36.1MB/s), 34.4MiB/s-34.4MiB/s (36.1MB/s-36.1MB/s), io=1033MiB (1083MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=263030/2, sectors=2104240/112, merge=0/12, ticks=27729/0, in_queue=27730, util=89.40%