Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/disk/container/random-write.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=16
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

random-write: (groupid=0, jobs=1): err= 0: pid=9: Tue Sep 22 05:20:04 2026
  write: IOPS=8183, BW=32.0MiB/s (33.5MB/s)(959MiB/30001msec); 0 zone resets
    clat (usec): min=47, max=5047, avg=121.60, stdev=80.45
     lat (usec): min=48, max=5047, avg=121.71, stdev=80.45
    clat percentiles (usec):
     |  1.00th=[   51],  5.00th=[   52], 10.00th=[   53], 20.00th=[   56],
     | 30.00th=[   58], 40.00th=[   62], 50.00th=[   91], 60.00th=[  155],
     | 70.00th=[  161], 80.00th=[  169], 90.00th=[  190], 95.00th=[  247],
     | 99.00th=[  388], 99.50th=[  408], 99.90th=[  465], 99.95th=[  701],
     | 99.99th=[ 1172]
   bw (  KiB/s): min=22131, max=37232, per=100.00%, avg=32871.14, stdev=4231.19, samples=59
   iops        : min= 5532, max= 9308, avg=8217.66, stdev=1057.88, samples=59
  lat (usec)   : 50=0.07%, 100=50.15%, 250=44.83%, 500=4.87%, 750=0.03%
  lat (usec)   : 1000=0.03%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.34%, sys=8.82%, ctx=245452, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,245505,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=32.0MiB/s (33.5MB/s), 32.0MiB/s-32.0MiB/s (33.5MB/s-33.5MB/s), io=959MiB (1006MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=0/244708, sectors=0/1957872, merge=0/26, ticks=0/31934, in_queue=35946, util=90.90%