Cloud-Computing/Exp-02-Vm-vs-container-performance/results/raw/disk/container/seq-read.txt
seq-read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=16
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

seq-read: (groupid=0, jobs=1): err= 0: pid=10: Tue Sep 22 05:16:10 2026
  read: IOPS=4122, BW=4122MiB/s (4323MB/s)(121GiB/30001msec)
    clat (usec): min=161, max=23432, avg=241.96, stdev=171.89
     lat (usec): min=161, max=23432, avg=242.01, stdev=171.90
    clat percentiles (usec):
     |  1.00th=[  172],  5.00th=[  182], 10.00th=[  194], 20.00th=[  196],
     | 30.00th=[  198], 40.00th=[  200], 50.00th=[  202], 60.00th=[  206],
     | 70.00th=[  215], 80.00th=[  255], 90.00th=[  355], 95.00th=[  404],
     | 99.00th=[  742], 99.50th=[  881], 99.90th=[ 1876], 99.95th=[ 2802],
     | 99.99th=[ 5211]
   bw (  MiB/s): min= 2460, max= 5026, per=100.00%, avg=4139.63, stdev=746.20, samples=59
   iops        : min= 2460, max= 5026, avg=4139.53, stdev=746.21, samples=59
  lat (usec)   : 250=79.60%, 500=17.91%, 750=1.55%, 1000=0.62%
  lat (msec)   : 2=0.25%, 4=0.06%, 10=0.02%, 20=0.01%, 50=0.01%
  cpu          : usr=0.89%, sys=11.13%, ctx=123673, majf=0, minf=268
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=123672,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=4122MiB/s (4323MB/s), 4122MiB/s-4122MiB/s (4323MB/s-4323MB/s), io=121GiB (130GB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=246326/2, sectors=252237824/120, merge=0/13, ticks=53429/1, in_queue=53429, util=85.57%